<a href="https://colab.research.google.com/github/mdeniz20/NLP-0/blob/main/sqlite_agent.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!pip install cohere --upgrade

In [288]:
import sqlite3
import cohere

In [289]:
con = sqlite3.connect("database.db")
cur = con.cursor()

In [290]:
cur.execute("DROP TABLE IF EXISTS employee")

cur.execute("""CREATE TABLE IF NOT EXISTS employee (
    id INTEGER PRIMARY KEY,
    name VARCHAR(50),
    birth_date TIMESTAMP,
    salary REAL
)""")  # Removed extra comma after PRIMARY_KEY(id) and changed INT to INTEGER
#date is yyyy-mm-dd
cur.execute("SELECT name FROM sqlite_master WHERE type='table'")  # Changed SHOW TABLES (which is not supported in SQLite)
results = cur.fetchall()
print(results)  # Print the results to verify table creation

[('employee',)]

In [291]:
def insert_employee(name, birth_date, salary):
    cur.execute("INSERT INTO employee (name, birth_date, salary) VALUES (?, ?, ?)", (name, birth_date, salary))
    con.commit()

In [292]:
def populate_table():
  cur.execute("""INSERT INTO employee (name, birth_date, salary)
VALUES
    ('John Doe', '1990-05-15 00:00:00', 60000.00),
    ('Jane Smith', '1985-10-22 00:00:00', 75000.00),
    ('Michael Johnson', '1988-03-18 00:00:00', 90000.00),
    ('Emily Brown', '1992-07-01 00:00:00', 55000.00),
    ('William Lee', '1995-11-30 00:00:00', 65000.00),
    -- Add more employees here as needed
    ('Sophia Martinez', '1987-09-08 00:00:00', 80000.00),
    ('Alexander Davis', '1993-02-25 00:00:00', 70000.00),
    ('Olivia Rodriguez', '1996-06-14 00:00:00', 50000.00),
    ('James Wilson', '1989-12-10 00:00:00', 85000.00),
    ('Emma Garcia', '1991-04-03 00:00:00', 62000.00),
    -- Add more employees here as needed
    ('Ethan Taylor', '1986-08-20 00:00:00', 72000.00),
    ('Isabella Anderson', '1994-01-17 00:00:00', 68000.00),
    ('Daniel Thomas', '1984-11-05 00:00:00', 58000.00),
    ('Ava Moore', '1997-03-22 00:00:00', 67000.00),
    ('Matthew White', '1998-09-04 00:00:00', 59000.00),
    -- Add more employees here as needed
    ('Mia Martin', '1983-07-12 00:00:00', 72000.00),
    ('Jackson Garcia', '1990-02-01 00:00:00', 79000.00),
    ('Avery Wilson', '1987-06-18 00:00:00', 63000.00),
    ('David Thompson', '1995-12-09 00:00:00', 55000.00),
    ('Sophie Hernandez', '1989-04-28 00:00:00', 71000.00),
    -- Add more employees here as needed
    ('Logan Lopez', '1993-10-14 00:00:00', 68000.00),
    ('Grace Young', '1996-03-05 00:00:00', 60000.00),
    ('Benjamin Scott', '1984-05-25 00:00:00', 73000.00),
    ('Lily King', '1992-11-16 00:00:00', 57000.00),
    ('Ryan Adams', '1991-07-23 00:00:00', 69000.00),
    -- Add more employees here as needed
    ('Lucas Carter', '1988-01-08 00:00:00', 64000.00),
    ('Zoe Wright', '1994-08-03 00:00:00', 66000.00),
    ('Gabriel Thomas', '1986-12-29 00:00:00', 80000.00),
    ('Madison Parker', '1997-09-19 00:00:00', 54000.00),
    ('Nathan Robinson', '1985-04-07 00:00:00', 77000.00),
    -- Add more employees here as needed
    ('Chloe Mitchell', '1998-10-27 00:00:00', 61000.00),
    ('Samuel Perez', '1983-02-13 00:00:00', 74000.00),
    ('Hannah Hill', '1990-06-02 00:00:00', 59000.00),
    ('Elijah Gonzales', '1987-12-21 00:00:00', 72000.00),
    ('Aria Edwards', '1996-08-11 00:00:00', 68000.00),
    -- Add more employees here as needed
    ('Noah Flores', '1993-03-01 00:00:00', 65000.00),
    ('Mila Cook', '1989-09-24 00:00:00', 69000.00),
    ('Liam Stewart', '1991-01-13 00:00:00', 58000.00),
    ('Aubrey Rivera', '1984-07-04 00:00:00', 71000.00),
    ('Aiden Morgan', '1992-12-26 00:00:00', 62000.00),
    -- Add more employees here as needed
    ('Harper Bell', '1995-05-18 00:00:00', 67000.00),
    ('Carter Coleman', '1986-11-07 00:00:00', 73000.00),
    ('Scarlett Reed', '1994-04-25 00:00:00', 60000.00),
    ('Jayden Cooper', '1988-10-16 00:00:00', 71000.00),
    ('Ella Hughes', '1997-06-05 00:00:00', 56000.00);
""")
  con.commit()

def clear_table():
  cur.execute("DELETE FROM employee")
  con.commit()

In [293]:
clear_table()
populate_table()

In [294]:
res = cur.execute("SELECT * FROM employee WHERE TRUE")
res.fetchall()

[(1, 'John Doe', '1990-05-15 00:00:00', 60000.0),
 (2, 'Jane Smith', '1985-10-22 00:00:00', 75000.0),
 (3, 'Michael Johnson', '1988-03-18 00:00:00', 90000.0),
 (4, 'Emily Brown', '1992-07-01 00:00:00', 55000.0),
 (5, 'William Lee', '1995-11-30 00:00:00', 65000.0),
 (6, 'Sophia Martinez', '1987-09-08 00:00:00', 80000.0),
 (7, 'Alexander Davis', '1993-02-25 00:00:00', 70000.0),
 (8, 'Olivia Rodriguez', '1996-06-14 00:00:00', 50000.0),
 (9, 'James Wilson', '1989-12-10 00:00:00', 85000.0),
 (10, 'Emma Garcia', '1991-04-03 00:00:00', 62000.0),
 (11, 'Ethan Taylor', '1986-08-20 00:00:00', 72000.0),
 (12, 'Isabella Anderson', '1994-01-17 00:00:00', 68000.0),
 (13, 'Daniel Thomas', '1984-11-05 00:00:00', 58000.0),
 (14, 'Ava Moore', '1997-03-22 00:00:00', 67000.0),
 (15, 'Matthew White', '1998-09-04 00:00:00', 59000.0),
 (16, 'Mia Martin', '1983-07-12 00:00:00', 72000.0),
 (17, 'Jackson Garcia', '1990-02-01 00:00:00', 79000.0),
 (18, 'Avery Wilson', '1987-06-18 00:00:00', 63000.0),
 (19, 'David Thompson', '1995-12-09 00:00:00', 55000.0),
 (20, 'Sophie Hernandez', '1989-04-28 00:00:00', 71000.0),
 (21, 'Logan Lopez', '1993-10-14 00:00:00', 68000.0),
 (22, 'Grace Young', '1996-03-05 00:00:00', 60000.0),
 (23, 'Benjamin Scott', '1984-05-25 00:00:00', 73000.0),
 (24, 'Lily King', '1992-11-16 00:00:00', 57000.0),
 (25, 'Ryan Adams', '1991-07-23 00:00:00', 69000.0),
 (26, 'Lucas Carter', '1988-01-08 00:00:00', 64000.0),
 (27, 'Zoe Wright', '1994-08-03 00:00:00', 66000.0),
 (28, 'Gabriel Thomas', '1986-12-29 00:00:00', 80000.0),
 (29, 'Madison Parker', '1997-09-19 00:00:00', 54000.0),
 (30, 'Nathan Robinson', '1985-04-07 00:00:00', 77000.0),
 (31, 'Chloe Mitchell', '1998-10-27 00:00:00', 61000.0),
 (32, 'Samuel Perez', '1983-02-13 00:00:00', 74000.0),
 (33, 'Hannah Hill', '1990-06-02 00:00:00', 59000.0),
 (34, 'Elijah Gonzales', '1987-12-21 00:00:00', 72000.0),
 (35, 'Aria Edwards', '1996-08-11 00:00:00', 68000.0),
 (36, 'Noah Flores', '1993-03-01 00:00:00', 65000.0),
 (37, 'Mila Cook', '1989-09-24 00:00:00', 69000.0),
 (38, 'Liam Stewart', '1991-01-13 00:00:00', 58000.0),
 (39, 'Aubrey Rivera', '1984-07-04 00:00:00', 71000.0),
 (40, 'Aiden Morgan', '1992-12-26 00:00:00', 62000.0),
 (41, 'Harper Bell', '1995-05-18 00:00:00', 67000.0),
 (42, 'Carter Coleman', '1986-11-07 00:00:00', 73000.0),
 (43, 'Scarlett Reed', '1994-04-25 00:00:00', 60000.0),
 (44, 'Jayden Cooper', '1988-10-16 00:00:00', 71000.0),
 (45, 'Ella Hughes', '1997-06-05 00:00:00', 56000.0)]

In [295]:



"""
This is an agent class
"""

def list_to_string(lst):
  result = ""
  for i in range(len(lst)):
    result += lst[i] + (", " if i < len(lst) - 1 else "")
  return result

class SQLAgent:
  table: str = ""
  columns: str = ""
  co = None

  def __init__(self, table):
    self.co = cohere.Client("cohere_api")
    self.set_table(table)
    self.set_columns()

  def set_table(self, table_name):
    self.table = table_name

  def set_columns(self):
    self.columns = self.get_columns(self.table)

  def get_SQL_PROMPT_PREFIX(self) -> str:
    return f"These are the columns of the table '{self.table}': '{self.columns}'"

  ROLE = "You are an SQLite Agent. You are expert of SQLite queries. You get sufficient information and promt, then you give an SQL query."


  SQL_PROMPT_SUFFIX = """
- **ALWAYS** before giving the Final Answer, try another method.
Then reflect on the answers of the two methods you did and ask yourself
if it answers correctly the original question.
If you are not sure, try another method.
- If the methods tried do not give the same result,reflect and
try again until you have two methods that have the same result.
- If you still cannot arrive to a consistent result, say that
you are not sure of the answer.
- If you are sure of the correct answer, create a beautiful
and thorough response using Markdown.
- **DO NOT MAKE UP AN ANSWER OR USE PRIOR KNOWLEDGE,
ONLY USE THE RESULTS OF THE CALCULATIONS YOU HAVE DONE**.
- **ALWAYS**, give only and only the code as your "Final Answer". Do not provide any explenation or aditional punctiation or titles.
- Your response will be executed directly in sqlite.
- **ALWAYS**, give your answer in this format:
```sql
code
```
  """
  """
  - **ALWAYS**, as part of your "Final Answer", explain how you got
  to the answer on a section that starts with: "\n\nExplanation:\n".
  In the explanation, mention the column names that you used to get
  to the final answer.
  """



  """
  def get_tables(self)->list[str]:
    return []
  def get_tables_str(self) -> str:
    lst = self.get_tables()
    result = ""
    for i in range(len(lst)):
      result += lst[i] + (", " if i < len(lst) - 1 else "")
  """
  def get_columns(self, table_name: str) -> str:
    query = self.generate_query(f"get column name of the table '{self.table}'")
    result = cur.execute(query).fetchall()
    result_list = [f"{i[1]}: {i[2]}" for i in result]
    return list_to_string(result_list)


  def generate_query(self, prompt: str) -> str:
    prefix = self.get_SQL_PROMPT_PREFIX()
    response = self.co.chat(
	  message= self.ROLE + prefix + prompt + self.SQL_PROMPT_SUFFIX
    )
    response_list = response.text.split("\n")
    response_list = response_list[1:-1]
    result = ""
    for elem in response_list:
      result += elem + "\n"
    print(result)
    return result

  def run_query(self, soft_query: str) -> list:
    query = self.generate_query(soft_query)
    result = cur.execute(query).fetchall()
    return result

In [296]:
agent = SQLAgent("employee")

PRAGMA table_info(employee);

In [297]:
print(agent.columns)
print(agent.table)

id: INTEGER, name: VARCHAR(50), birth_date: TIMESTAMP, salary: REAL
employee

In [298]:
agent.run_query("all names of the employees")

SELECT name
FROM employee;

[('John Doe',),
 ('Jane Smith',),
 ('Michael Johnson',),
 ('Emily Brown',),
 ('William Lee',),
 ('Sophia Martinez',),
 ('Alexander Davis',),
 ('Olivia Rodriguez',),
 ('James Wilson',),
 ('Emma Garcia',),
 ('Ethan Taylor',),
 ('Isabella Anderson',),
 ('Daniel Thomas',),
 ('Ava Moore',),
 ('Matthew White',),
 ('Mia Martin',),
 ('Jackson Garcia',),
 ('Avery Wilson',),
 ('David Thompson',),
 ('Sophie Hernandez',),
 ('Logan Lopez',),
 ('Grace Young',),
 ('Benjamin Scott',),
 ('Lily King',),
 ('Ryan Adams',),
 ('Lucas Carter',),
 ('Zoe Wright',),
 ('Gabriel Thomas',),
 ('Madison Parker',),
 ('Nathan Robinson',),
 ('Chloe Mitchell',),
 ('Samuel Perez',),
 ('Hannah Hill',),
 ('Elijah Gonzales',),
 ('Aria Edwards',),
 ('Noah Flores',),
 ('Mila Cook',),
 ('Liam Stewart',),
 ('Aubrey Rivera',),
 ('Aiden Morgan',),
 ('Harper Bell',),
 ('Carter Coleman',),
 ('Scarlett Reed',),
 ('Jayden Cooper',),
 ('Ella Hughes',)]

In [299]:
agent.run_query("the name of the employee who has the highest salary")

SELECT name
FROM employee
ORDER BY salary DESC
LIMIT 1;

[('Michael Johnson',)]

In [300]:
agent.run_query("number of the employees born after 1990")

SELECT COUNT(*) AS "Number of Employees Born After 1990"
FROM employee
WHERE strftime('%Y', birth_date) > '1990';

[(23,)]

In [301]:
agent.run_query("the name of the employee who has the lowest salary")

SELECT name
FROM employee
ORDER BY salary ASC
LIMIT 1;

[('Olivia Rodriguez',)]

In [302]:
agent.run_query("the name and salary of the employee who has the second highest salary")

SELECT name, salary
FROM employee
ORDER BY salary DESC
LIMIT 1 OFFSET 1;

[('James Wilson', 85000.0)]

In [303]:
agent.run_query("add a new employee named james buston, born at 20 October 78, and earning 80000")

INSERT INTO employee (name, birth_date, salary)
VALUES ("james buston", '1978-10-20', 80000);

[]

In [304]:
agent.run_query("all information of the employee named james buston")

SELECT *
FROM employee
WHERE name = 'james buston';

[(46, 'james buston', '1978-10-20', 80000.0)]

In [306]:
agent.run_query("the name and salary of the last added employee")

SELECT name, salary
FROM employee
ORDER BY id DESC
LIMIT 1;

[('james buston', 80000.0)]